# gbXMLSurfaceType Enumeration (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
gbXMLSurfaceType Enumeration
See Also
---
This enumeration corresponds to the surfaceType attribute in gbXML and identifies the type of surface defined.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public enum gbXMLSurfaceType
```

Visual Basic
---
```text
Public Enumeration gbXMLSurfaceType
```

Visual C++
---
```text
public enum class gbXMLSurfaceType
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| InteriorWall | Interior wall. |
| ExteriorWall | Exterior wall. |
| Roof | Roof. |
| InteriorFloor | Interior floor. |
| Shade | Shade. |
| UndergroundWall | Underground wall. |
| UndergroundSlab | Underground slab. |
| Ceiling | Ceiling. |
| SurfaceAir | Surface air. |
| UndergroundCeiling | Underground ceiling. |
| RaisedFloor | Raised floor. |
| SlabOnGrade | Slab on grade. |
| NoOfSurfaceTypes | No of surface types. |

# See Also
Autodesk.Revit.DB.Analysis Namespace